# ADVANCED CONCEPTS ON PANDAS

## MERGING DATAFRAMES

Pandas provide Merging techniques on Dataframes. i.e-: combining or merging two or more dataframes

In [1]:
import pandas as pd

In [2]:
df = pd.DataFrame([{'Name': 'Sam', 'Purchased_Item': 'Football', 'Cost': 400},
                   {'Name': 'Peter', 'Purchased_Item': 'Cricket_Kit', 'Cost': 1000},
                   {'Name': 'Stiles', 'Purchased_Item': 'Basketball', 'Cost': 500}],
                  index=[1,2,3])

print("Creating our first dataframe ")
df

Creating our first dataframe

     Name Purchased_Item  Cost
1     Sam       Football   400
2   Peter    Cricket_Kit  1000
3  Stiles     Basketball   500

In [3]:
new_df= pd.DataFrame([{'L_Name': 'Win', 'Purchased_Date': '1-Jan-2020', 'Item_Type': 'Sports'},
                   {'L_Name': 'Hales', 'Purchased_Date': '1-Feb-2020', 'Item_Type': 'Sports'},
                   {'L_Name': 'Smith', 'Purchased_Date': '15-Jan-2020', 'Item_Type': 'Sports'}],
                  index=[4,5,6])

print("Creating our second dataframe ")

new_df

Creating our second dataframe

  L_Name Purchased_Date Item_Type
4    Win     1-Jan-2020    Sports
5  Hales     1-Feb-2020    Sports
6  Smith    15-Jan-2020    Sports

### Concatenation

In [4]:

comb_df = pd.concat([df,new_df], axis=0)
print("\nAfter concatenation along row\n")
comb_df

After concatenation along row

     Name Purchased_Item    Cost L_Name Purchased_Date Item_Type
1     Sam       Football   400.0    NaN            NaN       NaN
2   Peter    Cricket_Kit  1000.0    NaN            NaN       NaN
3  Stiles     Basketball   500.0    NaN            NaN       NaN
4     NaN            NaN     NaN    Win     1-Jan-2020    Sports
5     NaN            NaN     NaN  Hales     1-Feb-2020    Sports
6     NaN            NaN     NaN  Smith    15-Jan-2020    Sports

We have concatenated the two dataframes along row

In [5]:
comb_df.fillna(value=0, inplace=True)
print("\nAfter filling missing values with zero\n")
print(comb_df)

After filling missing values with zero

     Name Purchased_Item    Cost L_Name Purchased_Date Item_Type
1     Sam       Football   400.0      0              0         0
2   Peter    Cricket_Kit  1000.0      0              0         0
3  Stiles     Basketball   500.0      0              0         0
4       0              0     0.0    Win     1-Jan-2020    Sports
5       0              0     0.0  Hales     1-Feb-2020    Sports
6       0              0     0.0  Smith    15-Jan-2020    Sports

In [6]:
''' Filled the missing values with 0 using fillna function '''

' Filled the missing values with 0 using fillna function '

## Merge()

In [7]:
pd.merge(df, new_df, how='outer', left_on='Name', right_on='L_Name')

### how = "outer" means function will perform an outer join operation

     Name Purchased_Item    Cost L_Name Purchased_Date Item_Type
0     Sam       Football   400.0    NaN            NaN       NaN
1   Peter    Cricket_Kit  1000.0    NaN            NaN       NaN
2  Stiles     Basketball   500.0    NaN            NaN       NaN
3     NaN            NaN     NaN    Win     1-Jan-2020    Sports
4     NaN            NaN     NaN  Hales     1-Feb-2020    Sports
5     NaN            NaN     NaN  Smith    15-Jan-2020    Sports

Let's understand this using different dataframes

In [8]:
first_df = pd.DataFrame({'key1': ['12', '23', '34', '45'],
                     'key2': ['12', '23', '12', '23'],
                        'First': ['F0', 'F1', 'F2', 'F3'],
                        'Second': ['S0', 'S1', 'S2', 'S3']})
    
second_df = pd.DataFrame({'key1': ['12', '23', '12', '23'],
                               'key2': ['12', '12', '12', '12'],
                                  'Third': ['T0', 'T1', 'T2', 'T3']})

In [9]:
first_df

  key1 key2 First Second
0   12   12    F0     S0
1   23   23    F1     S1
2   34   12    F2     S2
3   45   23    F3     S3

In [10]:
second_df

  key1 key2 Third
0   12   12    T0
1   23   12    T1
2   12   12    T2
3   23   12    T3

In [11]:
pd.merge(first_df, second_df, on=['key1', 'key2'])

### Merging is done through common columns and by default how  = "inner"
### inner means it will perform the intersection between two dataframes.

  key1 key2 First Second Third
0   12   12    F0     S0    T0
1   12   12    F0     S0    T2

In [12]:
pd.merge(first_df, second_df, how='left' ,  on=['key1', 'key2'])

  key1 key2 First Second Third
0   12   12    F0     S0    T0
1   12   12    F0     S0    T2
2   23   23    F1     S1   NaN
3   34   12    F2     S2   NaN
4   45   23    F3     S3   NaN

In [13]:
print("In the above code merging is done by using how  = 'left'\nThis means the combined dataframe include the complete left dataframe which is first_df and the intersection of two dataframes")

In the above code merging is done by using how  = 'left'
This means the combined dataframe include the complete left dataframe which is first_df and the intersection of two dataframes

In [14]:
pd.merge(first_df, second_df, how='right' ,  on=['key1', 'key2'])

  key1 key2 First Second Third
0   12   12    F0     S0    T0
1   12   12    F0     S0    T2
2   23   12   NaN    NaN    T1
3   23   12   NaN    NaN    T3

In [15]:
print("In the above code merging is done by using how='right'\nThis means the combined dataframe include the complete right dataframe which is second_df and the intersection of two dataframe")

In the above code merging is done by using how='right'
This means the combined dataframe include the complete right dataframe which is second_df and the intersection of two dataframe

## JOIN

In [16]:
DF = pd.DataFrame({'Games': ['Chess', 'Sticky_Cricket', 'Foosball'],
                     'Movies': ['War', 'Bad_Boys', 'Extraction']},
                      index=['I0', 'I1', 'I2']) 

DF1 = pd.DataFrame({'Hobbies': ['Dance', 'Singing', 'Painting'],
                    'Pro': ['Computer', 'Dance', 'Pubg']},
                      index=['I1', 'I2', 'I3'])

In [17]:
DF

             Games      Movies
I0           Chess         War
I1  Sticky_Cricket    Bad_Boys
I2        Foosball  Extraction

In [18]:
DF1

     Hobbies       Pro
I1     Dance  Computer
I2   Singing     Dance
I3  Painting      Pubg

In [19]:
DF.join(DF1)

             Games      Movies  Hobbies       Pro
I0           Chess         War      NaN       NaN
I1  Sticky_Cricket    Bad_Boys    Dance  Computer
I2        Foosball  Extraction  Singing     Dance

In [20]:
DF.join(DF1 , how = 'outer')

             Games      Movies   Hobbies       Pro
I0           Chess         War       NaN       NaN
I1  Sticky_Cricket    Bad_Boys     Dance  Computer
I2        Foosball  Extraction   Singing     Dance
I3             NaN         NaN  Painting      Pubg

In [21]:
DF.join(DF1 , how = 'inner')

### joining of two dataframes in this is through common index of twwo dataframes

             Games      Movies  Hobbies       Pro
I1  Sticky_Cricket    Bad_Boys    Dance  Computer
I2        Foosball  Extraction  Singing     Dance

SO , CONCATENATE , MERGE  , JOIN are the methods to combine the two dataframes.

# GROUP BY

In [22]:
# Create dataframe
Data = {'Company':['GOOGLE','MSFT','APPLE','FB','AMAZON'],
       'Person':['Charlie','Amy','Vanessa','Carl','Sarah'],
       'Sales':[200,120,340,124,243]}
New_DF = pd.DataFrame(Data)
New_DF

  Company   Person  Sales
0  GOOGLE  Charlie    200
1    MSFT      Amy    120
2   APPLE  Vanessa    340
3      FB     Carl    124
4  AMAZON    Sarah    243

In [23]:
New_DF.groupby('Company')

### This is showing groupby method

In [24]:
A = New_DF.groupby('Company')

In [25]:
## If we want to display the data in a groupby object
list(A)

[('AMAZON',
    Company Person  Sales
  4  AMAZON  Sarah    243),
 ('APPLE',
    Company   Person  Sales
  2   APPLE  Vanessa    340),
 ('FB',
    Company Person  Sales
  3      FB   Carl    124),
 ('GOOGLE',
    Company   Person  Sales
  0  GOOGLE  Charlie    200),
 ('MSFT',
    Company Person  Sales
  1    MSFT    Amy    120)]

In [26]:
By_Company = New_DF.groupby('Company')
print("\nGrouping by 'Company' column and listing mean sales\n")
print(By_Company.mean())

Grouping by 'Company' column and listing mean sales

         Sales
Company
AMAZON     243
APPLE      340
FB         124
GOOGLE     200
MSFT       120

In [27]:
print("\nGrouping by 'Company' column and listing sum of sales\n")
print(By_Company.sum())

Grouping by 'Company' column and listing sum of sales

         Sales
Company
AMAZON     243
APPLE      340
FB         124
GOOGLE     200
MSFT       120

In [28]:
By_name = New_DF.groupby('Person')

In [29]:
By_name.count()

### Showing the count for different columns by grouping person

         Company  Sales
Person
Amy            1      1
Carl           1      1
Charlie        1      1
Sarah          1      1
Vanessa        1      1

# PIVOT TABLES

In [30]:
import seaborn as sns
import numpy as np
titanic = sns.load_dataset('titanic')

### Loading the datset

In [31]:
titanic = sns.load_dataset('titanic')

In [32]:
titanic.head()

## Printing the first five rows of datset

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

In [33]:
titanic.pivot_table(values='fare', index='sex', columns='class', aggfunc=np.mean)

class        First     Second      Third
sex
female  106.125798  21.970121  16.118810
male     67.226127  19.741782  12.661633

In [34]:
''' Pivot Table formed '''

### Different parameters used for different calculations .
### Here we have displayed the mean of fare of males and females on the basis of class

' Pivot Table formed '

# Date Function in Pandas

### Timestamp

In [35]:
pd.Timestamp('29/8/2020 10:05AM')

Timestamp('2020-08-29 10:05:00')

### Period

In [36]:
pd.Period('29/8/2020')

Period('2020-08-29', 'D')

In [37]:
pd.Period('8/2020')

Period('2020-08', 'M')

### DatetimeIndex

In [38]:
time = pd.Series(list('xyz'), [pd.Timestamp('2020-08-08'), pd.Timestamp('2020-11-11'), pd.Timestamp('2020-10-08')])
time

2020-08-08    x
2020-11-11    y
2020-10-08    z
dtype: object

Here we are done with some Advanced concepts of Pandas. Check out more functions and methods of Pandas in their official website 

https://pandas.pydata.org/